---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Plumbing.FlexPipe
source: html/4ba23e43-17c1-1a0a-0203-bbee880b34c9.htm
---
# FlexPipe Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.